[
    {
      "id": 1,
      "name": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/LzKKQqS/ORJ9YV0.jpg",
      "review": "A powerful story about racial injustice and moral growth in the American South.",
      "description": "To Kill a Mockingbird is a novel by Harper Lee published in 1960. It is set in the fictional town of Maycomb, Alabama, and is narrated by six-year-old Scout Finch. The novel explores the irrationality of adult attitudes toward race and class in the Deep South of the 1930s, as well as moral growth and heroism.",
      "totalPages": 281,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["classic", "racism", "coming-of-age"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "id": 2,
      "name": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/zbZZ3W9/ORJA090.jpg",
      "review": "A dystopian novel depicting a totalitarian regime and its impact on individual freedom.",
      "description": "1984 is a dystopian novel by George Orwell published in 1949. It depicts a totalitarian regime under the omnipresent surveillance of Big Brother. The novel explores themes of propaganda, censorship, and the loss of individual freedom.",
      "totalPages": 328,
      "rating": 4.7,
      "category": "Science Fiction",
      "tags": ["dystopian", "surveillance", "political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "id": 3,
      "name": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/yWf6XHZ/book-composition-with-open-book.jpg",
      "review": "A tale of love, wealth, and the American Dream set in the Roaring Twenties.",
      "description": "The Great Gatsby is a novel by F. Scott Fitzgerald published in 1925. Set in the fictional town of West Egg on Long Island, the story follows the mysterious millionaire Jay Gatsby and his passion for the beautiful Daisy Buchanan. The novel explores themes of the American Dream, wealth, and the excesses of the Jazz Age.",
      "totalPages": 218,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["classic", "1920s", "wealth"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "id": 4,
      "name": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/Hpg8ZjM/7492664.jpg",
      "review": "A witty and romantic comedy of manners exploring themes of class, marriage, and societal expectations.",
      "description": "Pride and Prejudice is a romantic novel by Jane Austen published in 1813. It follows the story of Elizabeth Bennet as she navigates issues of marriage, love, and social standing in early 19th-century England. The novel is celebrated for its wit, social commentary, and memorable characters.",
      "totalPages": 279,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["romance", "social", "regency era"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "id": 5,
      "name": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/crXvw1v/333.jpg",
      "review": "A coming-of-age novel following the disillusioned Holden Caulfield through New York City.",
      "description": "The Catcher in the Rye is a novel by J.D. Salinger published in 1951. It follows the story of Holden Caulfield, a disaffected teenager who struggles with alienation and the phoniness of the adult world. The novel is known for its exploration of teenage angst and rebellion.",
      "totalPages": 277,
      "rating": 4.2,
      "category": "Fiction",
      "tags": ["coming-of-age", "alienation", "youth"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "id": 6,
      "name": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/LrjmyGR/top-view-pile-books.jpg",
      "review": "An adventurous tale of Bilbo Baggins, a hobbit who embarks on a quest to reclaim treasure guarded by a dragon.",
      "description": "The Hobbit is a fantasy novel by J.R.R. Tolkien published in 1937. It follows the journey of Bilbo Baggins, a hobbit who is swept into an epic quest to reclaim the treasure guarded by the dragon Smaug. The novel is set in Tolkien's fictional universe of Middle-earth and is renowned for its adventure and world-building.",
      "totalPages": 310,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["adventure", "epic fantasy", "middle-earth"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
    }
  ]
  